""""
continue就是退出当前的循环进入下一次循环

吃5个苹果，吃到第3个，吃到虫子，第三个不吃了，没吃饱，继续吃第4，5个苹果

"""

#问题1：还会打印：吃到第3个苹果
i = 1
while i <= 5:
    if i == 3:
        print('吃出大虫子，这个苹果不吃了')
    print(f"吃了第{i}个苹果")
    i += 1

#问题2：陷入无限循环
"""""
i2 = 1
while i2 <= 5:
    if i2 == 3:
        print('吃出大虫子，这个苹果不吃了')
        continue #此处加入了continue
    print(f"吃了第{i2}个苹果")
    i2 += 1

"""


#3.如何修复？如果使用continue，在continue之前一定要修改计数器，否则进入死循环
i1 = 1
while i1 <= 5:
    if i1 == 3:
        print(f"第{i1}个苹果是坏的，不吃了")
        i1 += 1
    print(f'吃了第{i1}个苹果')
    i1 += 1